Template/kOmegaSST_Steady_simpelFoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet1
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet2
    {
        type            fixedValue;
        value           $internalField;
    }  
    
    outlet3
    {
        type            fixedValue;
        value           $internalField;
    }

    wall-volume_volume
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
